function [ mcc_para,Xsec ] = MCC_init( simulation ,constants )
%MCC_INIT 此处显示有关此函数的摘要
%   此处显示详细说明

mcc_para.T_gas=600;%K
mcc_para.pressure_gas=0.6;%Pa
mcc_para.n_target=mcc_para.pressure_gas/constants.kB/mcc_para.T_gas;

% % addpath('../') % 添加./packages到路径
% gasName = {'H2'};
% % directories of cross sections
% gasDir = {
% ['packages/cross_section/H2_Morgan_20170615'],...
% };
% % plot data (1) or not(0)
% interactive  = 0;
% Xsec = ImportLXCat;
% Xsec=Xsec.init(gasName, gasDir, interactive);
% disp(Xsec)
% Xsec.output_info()
  %%%%%%%%%%%%%%%%%%%%%%%%%%
  name=['intpCroSec.mat']; % 截面 σ-E
s=load(name);  
sc=struct2cell(s);  
CroSec=cell2mat(sc); 

Xsec = ImportLXCat;
Xsec.name{1}='for test';
Xsec.dir{1}='for test';
Xsec.ela{1}{1}=[CroSec(:,1),CroSec(:,2)];
% Xsec.add_key_points2();
Xsec.info.ela{1}{1}='From LZS HeavyRate';
Xsec.ion{1}{1}=[0,0;1e4,0];
Xsec.ionThresh{1}{1}=0;
Xsec.info.ion{1}{1}='no';
Xsec.exc{1}{1}=[0,0;1e4,0];
Xsec.excThresh{1}{1}=0;
Xsec.info.exc{1}{1}='no';
Xsec.att{1}{1}=[0,0;1e4,0];
% Xsec.attThresh{1}{1}=0;
Xsec.info.att{1}{1}='no';
Xsec.eff{1}{1}=[0,0;1e4,0];
Xsec=Xsec.getEnergy();
Xsec.info.eff{1}{1}='no';
Xsec=Xsec.totalXsection();
Xsec.tot{1,1}=Xsec.ela{1}{1};
Xsec.energy=CroSec(:,1);

% Xsec.ela{1}{1}=[0,6.40000000000000e-20;0.00100000000000000,6.40000000000000e-20;0.00200000000000000,6.49999900000000e-20;0.00300000000000000,6.60000000000000e-20;0.00500000000000000,6.80000000000000e-20;0.00700000000000000,7.09999900000000e-20;0.00850000000000000,7.20000000000000e-20;0.0100000000000000,7.30000000000000e-20;0.0150000000000000,7.69999900000000e-20;0.0200000000000000,8.00000000000000e-20;0.0300000000000000,8.49999900000000e-20;0.0400000000000000,8.96000000000000e-20;0.0500000000000000,9.27320000000000e-20;0.0700000000000000,9.83670000000000e-20;0.100000000000000,1.04595000000000e-19;0.120000000000000,1.08005666666667e-19;0.150000000000000,1.13403666666667e-19;0.170000000000000,1.15342200000000e-19;0.200000000000000,1.19250000000000e-19;0.250000000000000,1.24088750000000e-19;0.300000000000000,1.28927500000000e-19;0.350000000000000,1.33258750000000e-19;0.400000000000000,1.37590000000000e-19;0.500000000000000,1.45231000000000e-19;0.700000000000000,1.60206000000000e-19;1,1.69275000000000e-19;1.20000000000000,1.71797500000000e-19;1.30000000000000,1.73058750000000e-19;1.50000000000000,1.74020000000000e-19;1.70000000000000,1.72204666666667e-19;1.90000000000000,1.68871428571429e-19;2.10000000000000,1.65347428571429e-19;2.20000000000000,1.62739285714286e-19;2.50000000000000,1.53929214285714e-19;2.80000000000000,1.46733600000000e-19;3,1.42127000000000e-19;3.30000000000000,1.37839000000000e-19;3.60000000000000,1.30218495798319e-19;4,1.22739438914027e-19;4.50000000000000,1.14557719457014e-19;5,1.06376000000000e-19;6,8.99590005000000e-20;7,7.64203243333333e-20;8,6.72173343333333e-20;10,4.96480010000000e-20;12,3.87335728720721e-20;15,2.86705362143357e-20;17,2.40821559829663e-20;20,1.92099411876471e-20;25,1.33453677497059e-20;30,9.94129462176470e-21;50,4.28700001000000e-21;75,2.67058338833333e-21;100,1.37500010000000e-21;150,8.02999999999997e-22;200,2.35285714285716e-22;300,0;500,4.89999999999993e-23;700,2.92000000000007e-23;1000,0];



  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%
  %以上为截面导入
% for i=1:length(Xsec.energy)%%能量取高了没有意义，限定在3000eV以下
%     if Xsec.energy(i)<=3000
%         energy(i)=Xsec.energy(i);
%         tot_sec(i)=Xsec.tot{1,1}(i);
%     end
% end
[max_secXv ,~]=max(Xsec.tot{1,1}(:,2).*sqrt(2*abs(constants.q_m_ration_H*2)*Xsec.energy));
mcc_para.max_rate=mcc_para.n_target*max_secXv;%最大反应速率
mcc_para.P_null=1-exp(-mcc_para.max_rate*simulation.dt);%最大反应概率
%%%%%%%%%%%%%%%%%%
%以上为只需进行一次的运算，写到初始化里
mcc_para.ion_index=length(Xsec.ion{1,1});%到第几个是电离
mcc_para.att_index=length(Xsec.att{1,1})+mcc_para.ion_index;%到第几个是吸附
mcc_para.ela_index=length(Xsec.ela{1,1})+mcc_para.att_index;%到第几个是弹碰
mcc_para.exc_index=length(Xsec.exc{1,1})+mcc_para.ela_index;%到第几个是激发

end

